georgik/m5stack-atom-s3r-joystick-usb/sdkconfig.defaults
# ESP-IDF Configuration
# Target is determined by the board selection

CONFIG_IDF_TARGET=esp32s3

# PSRAM Configuration for boards that support it
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_MALLOC_ALWAYSINTERNAL=32768

# Bluetooth / BLE (NimBLE) for HID device
CONFIG_BT_ENABLED=y
CONFIG_BT_NIMBLE_ENABLED=y
CONFIG_BT_NIMBLE_SM_LVL=2
CONFIG_BT_NIMBLE_HID_SERVICE=y

# FATfs volume label (needed for f_setlabel in msc_storage)
CONFIG_FATFS_USE_LABEL=y

# TinyUSB MSC storage + HID interface
CONFIG_TINYUSB_MSC_ENABLED=y
CONFIG_TINYUSB_MSC_BUFSIZE=4096
CONFIG_TINYUSB_HID_COUNT=1

CONFIG_IDF_EXPERIMENTAL_FEATURES=y
